<template>
  <svg xmlns="http://www.w3.org/2000/svg" width="24.931" height="25.5" viewBox="0 0 31.931 32.5">
    <title>Página de Exemplo</title>

    <path
      id="prefix__direction"
      d="M54.7 37.942a1.681 1.681 0 0 1-2.07-1.167 12.99 12.99 0 0 0-4.546-6.745 12.822 12.822 0 0 0-17.918 2.22l-1.325.39-.213-3.74a16.2 16.2 0 0 1 21.506-1.535 16.372 16.372 0 0 1 5.729 8.5 1.681 1.681 0 0 1-1.163 2.077zm-3.617 9.908l-1.325.39a12.85 12.85 0 0 1-22.464-4.526 1.681 1.681 0 0 0-3.238.9 16.372 16.372 0 0 0 5.729 8.5 16.174 16.174 0 0 0 21.506-1.535zm-24.374-9.915l9.523-2.8a1.68 1.68 0 1 0-.948-3.224l-7.489 2.2-.443-7.966a1.68 1.68 0 1 0-3.352.188l.56 10.083a1.681 1.681 0 0 0 2.152 1.519zm27.628 17.991a1.681 1.681 0 0 0 1.585-1.771l-.56-10.083a1.681 1.681 0 0 0-2.152-1.519l-9.523 2.8a1.681 1.681 0 1 0 .948 3.224l7.488-2.2.443 7.966a1.681 1.681 0 0 0 1.676 1.587h.095z"
      transform="translate(-23.994 -23.999)"
    />
  </svg>
</template>

<script>
export default {
  name: "Sync",
  data() {
    return {
      msg: "Welcome to Your Vue.js App"
    };
  }
};
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
svg {
  cursor: pointer;
}
</style>
